"""
1)
Создайте класс ПЕРСОНА с абстрактными методами, позволяющими вывести на экран информацию о персоне,
а также определить ее возраст (в текущем году).
Создайте дочерние классы:
АБИТУРИЕНТ (фамилия, дата рождения, факультет),
СТУДЕНТ (фамилия, дата рождения, факультет, курс),
ПРЕПОДАВАТЕЛЬ (фамилия, дата рождения, факультет, должность, стаж),
со своими методами вывода информации на экран и определения возраста.
Создайте список из n персон, выведите полную информацию из базы на экран, а также организуйте поиск персон,
чей возраст попадает в заданный диапазон.
"""


"""
2)
Создать подобие социальной сети. 
Описать классы, которые должны выполнять соответствующие функции 
(Предлагаю насследовать класс авторизации от класса регистрации). 
Добавить проверку на валидность пароля (содержание символов и цифр), 
проверка на уникальность логина пользователя.
Человек заходит, и имеет возможность зарегистрироваться (ввод логин, пароль, потдверждение пароля), 
далее входит в свою учетную запись.
Добавить возможность выхода из учетной записи, и вход в новый аккаунт. 
Создать класс User, 
котоырй должен разделять роли обычного пользователя и администратора. 
При входе под обычным пользователем мы можем добавить новый пост, с определённым содержимим, 
так же пост должен содержать дату публикации. 
Под учётной записью администратора мы можем увидеть всех пользователей нашей системы, дату их регистрации, и их посты.
"""
